oxidecomputer/DAPLink/source/hic_hal/nxp/lpc55xx/DAP_config.h
/** Get timestamp of Test Domain Timer.
\return Current timestamp value.
*/
__STATIC_INLINE uint32_t TIMESTAMP_GET (void) {
  return (DWT->CYCCNT) / (CPU_CLOCK / TIMESTAMP_CLOCK);
}

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_Initialization_gr CMSIS-DAP Initialization
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware I/O and LED Pins are initialized with the function \ref DAP_SETUP.
*/

/** Setup of the Debug Unit I/O pins and LEDs (called when Debug Unit is initialized).
This function performs the initialization of the CMSIS-DAP Hardware I/O Pins and the
Status LEDs. In detail the operation of Hardware I/O and LED pins are enabled and set:
 - I/O clock system enabled.
 - all I/O pins: input buffer enabled, output pins are set to HighZ mode.
 - for nTRST, nRESET a weak pull-up (if available) is enabled.
 - LED output pins are enabled and LEDs are turned off.
*/
__STATIC_INLINE void DAP_SETUP(void)
{
    // Configure pins.
    static const iocon_group_t kPinConfigs[] = {
        {   .port = PIN_PIO_PORT,   .pin = PIN_TCK_SWCLK,       .modefunc = IOCON_FUNC0
                                                                            | IOCON_DIGITAL_EN
                                                                            | IOCON_MODE_PULLDOWN
                                                                            | IOCON_SLEW_FAST
                                                                            },
        {   .port = PIN_PIO_PORT,   .pin = PIN_TMS_SWDIO,       .modefunc = IOCON_FUNC0
                                                                            | IOCON_DIGITAL_EN
                                                                            | IOCON_MODE_PULLDOWN
                                                                            | IOCON_SLEW_FAST
                                                                            },
        {   .port = PIN_PIO_PORT,   .pin = PIN_TMS_SWDIO_TXEN,  .modefunc = IOCON_FUNC0
                                                                            | IOCON_DIGITAL_EN
                                                                            | IOCON_SLEW_FAST
                                                                            },
        {   .port = PIN_PIO_PORT,   .pin = PIN_TDI,             .modefunc = IOCON_FUNC0
                                                                            | IOCON_DIGITAL_EN
                                                                            | IOCON_MODE_PULLDOWN
                                                                            | IOCON_SLEW_FAST
                                                                            },
        {   .port = PIN_PIO_PORT,   .pin = PIN_TDO_SWO,         .modefunc = IOCON_FUNC0
                                                                            | IOCON_DIGITAL_EN
                                                                            | IOCON_MODE_PULLUP
                                                                            },
        {   .port = PIN_PIO_PORT,   .pin = PIN_RESET,           .modefunc = IOCON_FUNC0
                                                                            | IOCON_DIGITAL_EN
                                                                            },
        {
            .port = PIN_SWD_VCCIO_EN_PORT,
            .pin = PIN_SWD_VCCIO_EN,
            .modefunc = IOCON_FUNC0 | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_UART_VCCIO_EN_PORT,
            .pin = PIN_UART_VCCIO_EN,
            .modefunc = IOCON_FUNC0 | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SWD_STATUS_LED_PORT,
            .pin = PIN_SWD_STATUS_LED,
            .modefunc = IOCON_FUNC0 | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_UART_STATUS_LED_PORT,
            .pin = PIN_UART_STATUS_LED,
            .modefunc = IOCON_FUNC0 | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_RESET_IN_PORT,
            .pin = PIN_RESET_IN,
            .modefunc = IOCON_FUNC0 | IOCON_DIGITAL_EN | IOCON_MODE_PULLUP
        },
        {
            .port = PIN_VREF_TARGET_SWD_PORT,
            .pin = PIN_VREF_TARGET_SWD,
            .modefunc = IOCON_FUNC0 | IOCON_MODE_INACT// TODO IOCON_ANALOG_EN
        },
        {
            .port = PIN_VREF_TARGET_SWD_PORT,
            .pin = PIN_VREF_TARGET_SWD,
            .modefunc = IOCON_FUNC0 | IOCON_MODE_INACT // TODO IOCON_ANALOG_EN |
        },
    };

    IOCON_SetPinMuxing(IOCON, kPinConfigs, ARRAY_SIZE(kPinConfigs));

    // Configure GPIO outputs.
    GPIO->CLR[PIN_PIO_PORT] = PIN_TMS_SWDIO_TXEN_MASK   // Disable TMS/SWDIO drive.
                                | PIN_RESET_MASK;  // Dont assert reset

    // disable output buffers
    GPIO->CLR[PIN_SWD_VCCIO_EN_PORT] = PIN_SWD_VCCIO_EN_MASK;
    //GPIO->CLR[PIN_UART_VCCIO_EN_PORT] = PIN_UART_VCCIO_EN_MASK;
    //TODO control?
    GPIO->SET[PIN_UART_VCCIO_EN_PORT] = PIN_UART_VCCIO_EN_MASK;

    // turn off LEDs
    GPIO->SET[PIN_SWD_STATUS_LED_PORT] = PIN_SWD_STATUS_LED_MASK;
    GPIO->SET[PIN_UART_STATUS_LED_PORT] = PIN_UART_STATUS_LED_MASK;

    // Set GPIO directions.
    // TODO cleanup port assumption

    // set outputs
    GPIO->DIRSET[PIN_PIO_PORT] = PIN_TMS_SWDIO_TXEN_MASK
                                    | PIN_RESET_MASK
                                    | PIN_SWD_VCCIO_EN_MASK
                                    | PIN_UART_VCCIO_EN_MASK
                                    | PIN_SWD_STATUS_LED_MASK
                                    | PIN_UART_STATUS_LED_MASK;

    // set inputs
    GPIO->DIRCLR[PIN_PIO_PORT] = PIN_TCK_SWCLK_MASK
                                    | PIN_TMS_SWDIO_MASK
                                    | PIN_TDO_SWO_MASK
                                    | PIN_TDI_MASK
                                    | PIN_RESET_MASK;
    GPIO->DIRCLR[PIN_VREF_TARGET_SWD_PORT] = PIN_VREF_TARGET_SWD_MASK;
    GPIO->DIRCLR[PIN_VREF_TARGET_UART_PORT] = PIN_VREF_TARGET_UART_MASK;
}

/** Reset Target Device with custom specific I/O pin or command sequence.
This function allows the optional implementation of a device specific reset sequence.
It is called when the command \ref DAP_ResetTarget and is for example required
when a device needs a time-critical unlock sequence that enables the debug port.
\return 0 = no device specific reset sequence is implemented.\n
        1 = a device specific reset sequence is implemented.
*/
__STATIC_INLINE uint32_t RESET_TARGET(void)
{
    return (0);              // change to '1' when a device reset sequence is implemented
}

///@}


#endif /* __DAP_CONFIG_H__ */
